app/views/items/index.html.erb

  <p><%= raw(child.body) %></p>
  <% unless child.triggers.empty? %>
---
SELECT "triggers".* FROM "triggers" WHERE "triggers"."item_id" = 1

    <%= label_tag :emailrecip, 'Recipients:' %>
    <%= collection_select(:trigger_email, :email_id, Email.all, :id, :email, {}, {multiple: true, required: true}) %>
---
SELECT "emails".* FROM "emails"