app/views/items/show.html.erb

SELECT "triggers".* FROM "triggers" WHERE "triggers"."item_id" = 1
SELECT COUNT(*) FROM "triggers" WHERE "triggers"."item_id" = 1
---
  <p><%= raw(@item.body) %></p>
  <% unless @item.triggers.empty? %>

SELECT "emails".* FROM "emails" INNER JOIN "trigger_emails" ON "emails"."id" = "trigger_emails"."email_id" WHERE "trigger_emails"."trigger_id" = 1
---
      <% @item.triggers.each do |trigger| %>
        <% trigger.emails.each do |email| %> <%= email.email %> on <%= trigger.date_trigger.strftime("%d/%m/%Y") %>