app/controllers/items_controller.rb

INSERT INTO "items" ("body", "complete", "created_at", "parent_id", "task", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["body", "1"], ["complete", false], ["created_at", Sat, 05 Oct 2013 08:10:26 UTC +00:00], ["parent_id", 3], ["task", true], ["title", "test"], ["updated_at", Sat, 05 Oct 2013 08:10:26 UTC +00:00]]
---
  def create
    @item = Item.new(params[:item])

    if @item.save

SELECT "items".* FROM "items" WHERE "items"."pid" IS NULL
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def edit
    @items = Item.order_by('title, created_at').top_level
    @item = Item.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."pid" IS NULL ORDER BY "items"."id" DESC LIMIT 1
---
  def index
    @items = Item.order_by('title, created_at').top_level

SELECT "items".* FROM "items" WHERE "items"."pid" IS NULL
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "show"]]
SELECT "emails".* FROM "emails"
---
  def show
    @items = Item.order_by('title, created_at').top_level
    @item = Item.find(params[:id])
    @children = @item.children
    @emails = Email.all

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "items" SET "body" = 'Off to IKEA to taste delicious Swedish foods!lll', "updated_at" = '2013-10-05 21:49:43.082481' WHERE "items"."id" = 1
---
  def update
    @item = Item.find(params[:id])

    if @item.update_attributes(params[:item])