app/controllers/triggers_controller.rb

    def create
        new_trigger = Trigger.new do |t|
            t.item_id = params[:parent_id]
            t.date_trigger = DateTime.strptime(params[:datepicker] + " 00:00:00", "%d/%m/%Y %H:%M:%S")
            t.subchildren = params[:emailchildren].nil? ? false : true
            t.save!
        end
        #attach email to trigger
        new_trigger_email = TriggerEmail.new do |t|
            t.email_id = params[:trigger_email][:email_id]
            t.trigger_id = new_trigger.id
            t.save!
---
INSERT INTO "triggers" ("date_trigger", "item_id", "subchildren") VALUES ($1, $2, $3) RETURNING "id"  [["date_trigger", Wed, 09 Oct 2013 00:00:00 UTC +00:00], ["item_id", 1], ["subchildren", true]]
INSERT INTO "trigger_emails" ("email_id", "trigger_id") VALUES ($1, $2) RETURNING "id"  [["email_id", 1], ["trigger_id", 4]]