app/views/application/_hierachy.html.erb

SELECT "items".* FROM "items" WHERE "items"."parent_id" IS NULL
---
  <p id = "itemToRoot"><%= link_to "+ Add Item To Root", new_item_path %></p>
  <ul><%= render :partial => 'items/item', :collection => Item.find_all_by_parent_id(nil) %></ul>